In [1]:
import pandas as pd

In [2]:
str_list = [f'{x}.{y}.{z}'
            for x in ['one', 'two', 'three']
            for y in ['a', 'b', 'c', 'd']
            for z in ['X', 'Y', 'Z']]
str_list[:4]

['one.a.X', 'one.a.Y', 'one.a.Z', 'one.b.X']

In [3]:
df = pd.DataFrame({'col': str_list})
df.head()

       col
0  one.a.X
1  one.a.Y
2  one.a.Z
3  one.b.X
4  one.b.Y

# Split and Join

`str.split` and `str.join` are each the inverse of the other. We can test a round trip:

In [4]:
(df.col
 .str.split('.')
 .str.join(sep='-')
)

0       one-a-X
1       one-a-Y
2       one-a-Z
3       one-b-X
4       one-b-Y
5       one-b-Z
6       one-c-X
7       one-c-Y
8       one-c-Z
9       one-d-X
10      one-d-Y
11      one-d-Z
12      two-a-X
13      two-a-Y
14      two-a-Z
15      two-b-X
16      two-b-Y
17      two-b-Z
18      two-c-X
19      two-c-Y
20      two-c-Z
21      two-d-X
22      two-d-Y
23      two-d-Z
24    three-a-X
25    three-a-Y
26    three-a-Z
27    three-b-X
28    three-b-Y
29    three-b-Z
30    three-c-X
31    three-c-Y
32    three-c-Z
33    three-d-X
34    three-d-Y
35    three-d-Z
Name: col, dtype: object

## Split and take one element

In [5]:
(df.col
 .str.split('.')
 .str[0:2]
 .str.join(sep='*')
).head()

0    one*a
1    one*a
2    one*a
3    one*b
4    one*b
Name: col, dtype: object

In [6]:
(df
 .assign(col0=(df.col
               .str.split('.')
               .str[0:2]
               .str.join(sep='*')
              )
        )
).head()

       col   col0
0  one.a.X  one*a
1  one.a.Y  one*a
2  one.a.Z  one*a
3  one.b.X  one*b
4  one.b.Y  one*b